Refine NexusOps documentation
